IDEA StatiCa Open Model
OpeningRectOffsets.X2 Property
Compatible with IDEA StatiCa Beta 21.0 - beta
 Right
 Namespace: IdeaRS.OpenModel.Detail
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public double X2 { get; set; }
Public Property X2 As Double
	Get
	Set
public:
property double X2 {
	double get ();
	void set (double value);
}
Property Value
Type: Double
See Also
Reference
OpeningRectOffsets Class
IdeaRS.OpenModel.Detail Namespace